Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/include/component/gpio.h
/**
 * \brief Component description for GPIO
 *
 * Copyright (c) 2020 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2020-07-31T00:50:46Z */
#ifndef _BZ24_GPIO_COMPONENT_H_
#define _BZ24_GPIO_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR GPIO                                         */
/* ************************************************************************** */

/* -------- GPIO_ANSEL : (GPIO Offset: 0x00) (R/W 32)  -------- */
#define GPIO_ANSEL_RESETVALUE                 _U_(0x00)                                            /**<  (GPIO_ANSEL)   Reset Value */

#define GPIO_ANSEL_ANS0_Pos                   _U_(0)                                               /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS0_Msk                   (_U_(0x1) << GPIO_ANSEL_ANS0_Pos)                    /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS0(value)                (GPIO_ANSEL_ANS0_Msk & ((value) << GPIO_ANSEL_ANS0_Pos))
#define GPIO_ANSEL_ANS1_Pos                   _U_(1)                                               /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS1_Msk                   (_U_(0x1) << GPIO_ANSEL_ANS1_Pos)                    /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS1(value)                (GPIO_ANSEL_ANS1_Msk & ((value) << GPIO_ANSEL_ANS1_Pos))
#define GPIO_ANSEL_ANS2_Pos                   _U_(2)                                               /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS2_Msk                   (_U_(0x1) << GPIO_ANSEL_ANS2_Pos)                    /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS2(value)                (GPIO_ANSEL_ANS2_Msk & ((value) << GPIO_ANSEL_ANS2_Pos))
#define GPIO_ANSEL_ANS3_Pos                   _U_(3)                                               /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS3_Msk                   (_U_(0x1) << GPIO_ANSEL_ANS3_Pos)                    /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS3(value)                (GPIO_ANSEL_ANS3_Msk & ((value) << GPIO_ANSEL_ANS3_Pos))
#define GPIO_ANSEL_ANS4_Pos                   _U_(4)                                               /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS4_Msk                   (_U_(0x1) << GPIO_ANSEL_ANS4_Pos)                    /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS4(value)                (GPIO_ANSEL_ANS4_Msk & ((value) << GPIO_ANSEL_ANS4_Pos))
#define GPIO_ANSEL_ANS5_Pos                   _U_(5)                                               /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS5_Msk                   (_U_(0x1) << GPIO_ANSEL_ANS5_Pos)                    /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS5(value)                (GPIO_ANSEL_ANS5_Msk & ((value) << GPIO_ANSEL_ANS5_Pos))
#define GPIO_ANSEL_ANS6_Pos                   _U_(6)                                               /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS6_Msk                   (_U_(0x1) << GPIO_ANSEL_ANS6_Pos)                    /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS6(value)                (GPIO_ANSEL_ANS6_Msk & ((value) << GPIO_ANSEL_ANS6_Pos))
#define GPIO_ANSEL_ANS7_Pos                   _U_(7)                                               /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS7_Msk                   (_U_(0x1) << GPIO_ANSEL_ANS7_Pos)                    /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS7(value)                (GPIO_ANSEL_ANS7_Msk & ((value) << GPIO_ANSEL_ANS7_Pos))
#define GPIO_ANSEL_ANS8_Pos                   _U_(8)                                               /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS8_Msk                   (_U_(0x1) << GPIO_ANSEL_ANS8_Pos)                    /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS8(value)                (GPIO_ANSEL_ANS8_Msk & ((value) << GPIO_ANSEL_ANS8_Pos))
#define GPIO_ANSEL_ANS9_Pos                   _U_(9)                                               /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS9_Msk                   (_U_(0x1) << GPIO_ANSEL_ANS9_Pos)                    /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS9(value)                (GPIO_ANSEL_ANS9_Msk & ((value) << GPIO_ANSEL_ANS9_Pos))
#define GPIO_ANSEL_ANS10_Pos                  _U_(10)                                              /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS10_Msk                  (_U_(0x1) << GPIO_ANSEL_ANS10_Pos)                   /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS10(value)               (GPIO_ANSEL_ANS10_Msk & ((value) << GPIO_ANSEL_ANS10_Pos))
#define GPIO_ANSEL_ANS11_Pos                  _U_(11)                                              /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS11_Msk                  (_U_(0x1) << GPIO_ANSEL_ANS11_Pos)                   /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS11(value)               (GPIO_ANSEL_ANS11_Msk & ((value) << GPIO_ANSEL_ANS11_Pos))
#define GPIO_ANSEL_ANS12_Pos                  _U_(12)                                              /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS12_Msk                  (_U_(0x1) << GPIO_ANSEL_ANS12_Pos)                   /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS12(value)               (GPIO_ANSEL_ANS12_Msk & ((value) << GPIO_ANSEL_ANS12_Pos))
#define GPIO_ANSEL_ANS13_Pos                  _U_(13)                                              /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS13_Msk                  (_U_(0x1) << GPIO_ANSEL_ANS13_Pos)                   /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS13(value)               (GPIO_ANSEL_ANS13_Msk & ((value) << GPIO_ANSEL_ANS13_Pos))
#define GPIO_ANSEL_ANS14_Pos                  _U_(14)                                              /**< (GPIO_ANSEL)  Position */
#define GPIO_ANSEL_ANS14_Msk                  (_U_(0x1) << GPIO_ANSEL_ANS14_Pos)                   /**< (GPIO_ANSEL)  Mask */
#define GPIO_ANSEL_ANS14(value)               (GPIO_ANSEL_ANS14_Msk & ((value) << GPIO_ANSEL_ANS14_Pos))
#define GPIO_ANSEL_Msk                        _U_(0x00007FFF)                                      /**< (GPIO_ANSEL) Register Mask  */

#define GPIO_ANSEL_ANS_Pos                    _U_(0)                                               /**< (GPIO_ANSEL Position)  */
#define GPIO_ANSEL_ANS_Msk                    (_U_(0x7FFF) << GPIO_ANSEL_ANS_Pos)                  /**< (GPIO_ANSEL Mask) ANS */
#define GPIO_ANSEL_ANS(value)                 (GPIO_ANSEL_ANS_Msk & ((value) << GPIO_ANSEL_ANS_Pos)) 

/* -------- GPIO_ANSELCLR : (GPIO Offset: 0x04) (R/W 32)  -------- */
#define GPIO_ANSELCLR_RESETVALUE              _U_(0x00)                                            /**<  (GPIO_ANSELCLR)   Reset Value */

#define GPIO_ANSELCLR_Msk                     _U_(0x00000000)                                      /**< (GPIO_ANSELCLR) Register Mask  */


