Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/include/component/gpio.h
/* -------- GPIO_ANSELSET : (GPIO Offset: 0x08) (R/W 32)  -------- */
#define GPIO_ANSELSET_RESETVALUE              _U_(0x00)                                            /**<  (GPIO_ANSELSET)   Reset Value */

#define GPIO_ANSELSET_Msk                     _U_(0x00000000)                                      /**< (GPIO_ANSELSET) Register Mask  */


/* -------- GPIO_ANSELINV : (GPIO Offset: 0x0C) (R/W 32)  -------- */
#define GPIO_ANSELINV_RESETVALUE              _U_(0x00)                                            /**<  (GPIO_ANSELINV)   Reset Value */

#define GPIO_ANSELINV_Msk                     _U_(0x00000000)                                      /**< (GPIO_ANSELINV) Register Mask  */


/* -------- GPIO_TRIS : (GPIO Offset: 0x10) (R/W 32)  -------- */
#define GPIO_TRIS_RESETVALUE                  _U_(0x00)                                            /**<  (GPIO_TRIS)   Reset Value */

#define GPIO_TRIS_TRIS0_Pos                   _U_(0)                                               /**< (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS0_Msk                   (_U_(0x1) << GPIO_TRIS_TRIS0_Pos)                    /**< (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS0(value)                (GPIO_TRIS_TRIS0_Msk & ((value) << GPIO_TRIS_TRIS0_Pos))
#define GPIO_TRIS_TRIS1_Pos                   _U_(1)                                               /**< (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS1_Msk                   (_U_(0x1) << GPIO_TRIS_TRIS1_Pos)                    /**< (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS1(value)                (GPIO_TRIS_TRIS1_Msk & ((value) << GPIO_TRIS_TRIS1_Pos))
#define GPIO_TRIS_TRIS2_Pos                   _U_(2)                                               /**< (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS2_Msk                   (_U_(0x1) << GPIO_TRIS_TRIS2_Pos)                    /**< (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS2(value)                (GPIO_TRIS_TRIS2_Msk & ((value) << GPIO_TRIS_TRIS2_Pos))
#define GPIO_TRIS_TRIS3_Pos                   _U_(3)                                               /**< (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS3_Msk                   (_U_(0x1) << GPIO_TRIS_TRIS3_Pos)                    /**< (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS3(value)                (GPIO_TRIS_TRIS3_Msk & ((value) << GPIO_TRIS_TRIS3_Pos))
#define GPIO_TRIS_TRIS4_Pos                   _U_(4)                                               /**< (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS4_Msk                   (_U_(0x1) << GPIO_TRIS_TRIS4_Pos)                    /**< (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS4(value)                (GPIO_TRIS_TRIS4_Msk & ((value) << GPIO_TRIS_TRIS4_Pos))
#define GPIO_TRIS_TRIS5_Pos                   _U_(5)                                               /**< (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS5_Msk                   (_U_(0x1) << GPIO_TRIS_TRIS5_Pos)                    /**< (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS5(value)                (GPIO_TRIS_TRIS5_Msk & ((value) << GPIO_TRIS_TRIS5_Pos))
#define GPIO_TRIS_TRIS6_Pos                   _U_(6)                                               /**< (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS6_Msk                   (_U_(0x1) << GPIO_TRIS_TRIS6_Pos)                    /**< (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS6(value)                (GPIO_TRIS_TRIS6_Msk & ((value) << GPIO_TRIS_TRIS6_Pos))
#define GPIO_TRIS_TRIS7_Pos                   _U_(7)                                               /**< (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS7_Msk                   (_U_(0x1) << GPIO_TRIS_TRIS7_Pos)                    /**< (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS7(value)                (GPIO_TRIS_TRIS7_Msk & ((value) << GPIO_TRIS_TRIS7_Pos))
#define GPIO_TRIS_TRIS8_Pos                   _U_(8)                                               /**< (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS8_Msk                   (_U_(0x1) << GPIO_TRIS_TRIS8_Pos)                    /**< (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS8(value)                (GPIO_TRIS_TRIS8_Msk & ((value) << GPIO_TRIS_TRIS8_Pos))
#define GPIO_TRIS_TRIS9_Pos                   _U_(9)                                               /**< (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS9_Msk                   (_U_(0x1) << GPIO_TRIS_TRIS9_Pos)                    /**< (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS9(value)                (GPIO_TRIS_TRIS9_Msk & ((value) << GPIO_TRIS_TRIS9_Pos))
#define GPIO_TRIS_TRIS10_Pos                  _U_(10)                                              /**< (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS10_Msk                  (_U_(0x1) << GPIO_TRIS_TRIS10_Pos)                   /**< (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS10(value)               (GPIO_TRIS_TRIS10_Msk & ((value) << GPIO_TRIS_TRIS10_Pos))
#define GPIO_TRIS_TRIS13_Pos                  _U_(13)                                              /**< (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS13_Msk                  (_U_(0x1) << GPIO_TRIS_TRIS13_Pos)                   /**< (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS13(value)               (GPIO_TRIS_TRIS13_Msk & ((value) << GPIO_TRIS_TRIS13_Pos))
#define GPIO_TRIS_TRIS14_Pos                  _U_(14)                                              /**< (GPIO_TRIS)  Position */
#define GPIO_TRIS_TRIS14_Msk                  (_U_(0x1) << GPIO_TRIS_TRIS14_Pos)                   /**< (GPIO_TRIS)  Mask */
#define GPIO_TRIS_TRIS14(value)               (GPIO_TRIS_TRIS14_Msk & ((value) << GPIO_TRIS_TRIS14_Pos))
#define GPIO_TRIS_Msk                         _U_(0x000067FF)                                      /**< (GPIO_TRIS) Register Mask  */

#define GPIO_TRIS_TRIS_Pos                    _U_(0)                                               /**< (GPIO_TRIS Position)  */
#define GPIO_TRIS_TRIS_Msk                    (_U_(0x1FFF) << GPIO_TRIS_TRIS_Pos)                  /**< (GPIO_TRIS Mask) TRIS */
#define GPIO_TRIS_TRIS(value)                 (GPIO_TRIS_TRIS_Msk & ((value) << GPIO_TRIS_TRIS_Pos)) 

/* -------- GPIO_TRISCLR : (GPIO Offset: 0x14) (R/W 32)  -------- */
#define GPIO_TRISCLR_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_TRISCLR)   Reset Value */

#define GPIO_TRISCLR_Msk                      _U_(0x00000000)                                      /**< (GPIO_TRISCLR) Register Mask  */


