Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/include/component/gpio.h
/* -------- GPIO_TRISSET : (GPIO Offset: 0x18) (R/W 32)  -------- */
#define GPIO_TRISSET_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_TRISSET)   Reset Value */

#define GPIO_TRISSET_Msk                      _U_(0x00000000)                                      /**< (GPIO_TRISSET) Register Mask  */


/* -------- GPIO_TRISINV : (GPIO Offset: 0x1C) (R/W 32)  -------- */
#define GPIO_TRISINV_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_TRISINV)   Reset Value */

#define GPIO_TRISINV_Msk                      _U_(0x00000000)                                      /**< (GPIO_TRISINV) Register Mask  */


/* -------- GPIO_PORT : (GPIO Offset: 0x20) (R/W 32)  -------- */
#define GPIO_PORT_RESETVALUE                  _U_(0x00)                                            /**<  (GPIO_PORT)   Reset Value */

#define GPIO_PORT_R0_Pos                      _U_(0)                                               /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R0_Msk                      (_U_(0x1) << GPIO_PORT_R0_Pos)                       /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R0(value)                   (GPIO_PORT_R0_Msk & ((value) << GPIO_PORT_R0_Pos))  
#define GPIO_PORT_R1_Pos                      _U_(1)                                               /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R1_Msk                      (_U_(0x1) << GPIO_PORT_R1_Pos)                       /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R1(value)                   (GPIO_PORT_R1_Msk & ((value) << GPIO_PORT_R1_Pos))  
#define GPIO_PORT_R2_Pos                      _U_(2)                                               /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R2_Msk                      (_U_(0x1) << GPIO_PORT_R2_Pos)                       /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R2(value)                   (GPIO_PORT_R2_Msk & ((value) << GPIO_PORT_R2_Pos))  
#define GPIO_PORT_R3_Pos                      _U_(3)                                               /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R3_Msk                      (_U_(0x1) << GPIO_PORT_R3_Pos)                       /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R3(value)                   (GPIO_PORT_R3_Msk & ((value) << GPIO_PORT_R3_Pos))  
#define GPIO_PORT_R4_Pos                      _U_(4)                                               /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R4_Msk                      (_U_(0x1) << GPIO_PORT_R4_Pos)                       /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R4(value)                   (GPIO_PORT_R4_Msk & ((value) << GPIO_PORT_R4_Pos))  
#define GPIO_PORT_R5_Pos                      _U_(5)                                               /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R5_Msk                      (_U_(0x1) << GPIO_PORT_R5_Pos)                       /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R5(value)                   (GPIO_PORT_R5_Msk & ((value) << GPIO_PORT_R5_Pos))  
#define GPIO_PORT_R6_Pos                      _U_(6)                                               /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R6_Msk                      (_U_(0x1) << GPIO_PORT_R6_Pos)                       /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R6(value)                   (GPIO_PORT_R6_Msk & ((value) << GPIO_PORT_R6_Pos))  
#define GPIO_PORT_R7_Pos                      _U_(7)                                               /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R7_Msk                      (_U_(0x1) << GPIO_PORT_R7_Pos)                       /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R7(value)                   (GPIO_PORT_R7_Msk & ((value) << GPIO_PORT_R7_Pos))  
#define GPIO_PORT_R8_Pos                      _U_(8)                                               /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R8_Msk                      (_U_(0x1) << GPIO_PORT_R8_Pos)                       /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R8(value)                   (GPIO_PORT_R8_Msk & ((value) << GPIO_PORT_R8_Pos))  
#define GPIO_PORT_R9_Pos                      _U_(9)                                               /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R9_Msk                      (_U_(0x1) << GPIO_PORT_R9_Pos)                       /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R9(value)                   (GPIO_PORT_R9_Msk & ((value) << GPIO_PORT_R9_Pos))  
#define GPIO_PORT_R10_Pos                     _U_(10)                                              /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R10_Msk                     (_U_(0x1) << GPIO_PORT_R10_Pos)                      /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R10(value)                  (GPIO_PORT_R10_Msk & ((value) << GPIO_PORT_R10_Pos))
#define GPIO_PORT_R11_Pos                     _U_(11)                                              /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R11_Msk                     (_U_(0x1) << GPIO_PORT_R11_Pos)                      /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R11(value)                  (GPIO_PORT_R11_Msk & ((value) << GPIO_PORT_R11_Pos))
#define GPIO_PORT_R12_Pos                     _U_(12)                                              /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R12_Msk                     (_U_(0x1) << GPIO_PORT_R12_Pos)                      /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R12(value)                  (GPIO_PORT_R12_Msk & ((value) << GPIO_PORT_R12_Pos))
#define GPIO_PORT_R13_Pos                     _U_(13)                                              /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R13_Msk                     (_U_(0x1) << GPIO_PORT_R13_Pos)                      /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R13(value)                  (GPIO_PORT_R13_Msk & ((value) << GPIO_PORT_R13_Pos))
#define GPIO_PORT_R14_Pos                     _U_(14)                                              /**< (GPIO_PORT)  Position */
#define GPIO_PORT_R14_Msk                     (_U_(0x1) << GPIO_PORT_R14_Pos)                      /**< (GPIO_PORT)  Mask */
#define GPIO_PORT_R14(value)                  (GPIO_PORT_R14_Msk & ((value) << GPIO_PORT_R14_Pos))
#define GPIO_PORT_Msk                         _U_(0x00007FFF)                                      /**< (GPIO_PORT) Register Mask  */

#define GPIO_PORT_R_Pos                       _U_(0)                                               /**< (GPIO_PORT Position)  */
#define GPIO_PORT_R_Msk                       (_U_(0x7FFF) << GPIO_PORT_R_Pos)                     /**< (GPIO_PORT Mask) R */
#define GPIO_PORT_R(value)                    (GPIO_PORT_R_Msk & ((value) << GPIO_PORT_R_Pos))     

