Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/include/component/gpio.h
/* -------- GPIO_PORTCLR : (GPIO Offset: 0x24) (R/W 32)  -------- */
#define GPIO_PORTCLR_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_PORTCLR)   Reset Value */

#define GPIO_PORTCLR_Msk                      _U_(0x00000000)                                      /**< (GPIO_PORTCLR) Register Mask  */


/* -------- GPIO_PORTSET : (GPIO Offset: 0x28) (R/W 32)  -------- */
#define GPIO_PORTSET_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_PORTSET)   Reset Value */

#define GPIO_PORTSET_Msk                      _U_(0x00000000)                                      /**< (GPIO_PORTSET) Register Mask  */


/* -------- GPIO_PORTINV : (GPIO Offset: 0x2C) (R/W 32)  -------- */
#define GPIO_PORTINV_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_PORTINV)   Reset Value */

#define GPIO_PORTINV_Msk                      _U_(0x00000000)                                      /**< (GPIO_PORTINV) Register Mask  */


/* -------- GPIO_LAT : (GPIO Offset: 0x30) (R/W 32)  -------- */
#define GPIO_LAT_RESETVALUE                   _U_(0x00)                                            /**<  (GPIO_LAT)   Reset Value */

#define GPIO_LAT_LAT0_Pos                     _U_(0)                                               /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT0_Msk                     (_U_(0x1) << GPIO_LAT_LAT0_Pos)                      /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT0(value)                  (GPIO_LAT_LAT0_Msk & ((value) << GPIO_LAT_LAT0_Pos))
#define GPIO_LAT_LAT1_Pos                     _U_(1)                                               /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT1_Msk                     (_U_(0x1) << GPIO_LAT_LAT1_Pos)                      /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT1(value)                  (GPIO_LAT_LAT1_Msk & ((value) << GPIO_LAT_LAT1_Pos))
#define GPIO_LAT_LAT2_Pos                     _U_(2)                                               /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT2_Msk                     (_U_(0x1) << GPIO_LAT_LAT2_Pos)                      /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT2(value)                  (GPIO_LAT_LAT2_Msk & ((value) << GPIO_LAT_LAT2_Pos))
#define GPIO_LAT_LAT3_Pos                     _U_(3)                                               /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT3_Msk                     (_U_(0x1) << GPIO_LAT_LAT3_Pos)                      /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT3(value)                  (GPIO_LAT_LAT3_Msk & ((value) << GPIO_LAT_LAT3_Pos))
#define GPIO_LAT_LAT4_Pos                     _U_(4)                                               /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT4_Msk                     (_U_(0x1) << GPIO_LAT_LAT4_Pos)                      /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT4(value)                  (GPIO_LAT_LAT4_Msk & ((value) << GPIO_LAT_LAT4_Pos))
#define GPIO_LAT_LAT5_Pos                     _U_(5)                                               /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT5_Msk                     (_U_(0x1) << GPIO_LAT_LAT5_Pos)                      /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT5(value)                  (GPIO_LAT_LAT5_Msk & ((value) << GPIO_LAT_LAT5_Pos))
#define GPIO_LAT_LAT6_Pos                     _U_(6)                                               /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT6_Msk                     (_U_(0x1) << GPIO_LAT_LAT6_Pos)                      /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT6(value)                  (GPIO_LAT_LAT6_Msk & ((value) << GPIO_LAT_LAT6_Pos))
#define GPIO_LAT_LAT7_Pos                     _U_(7)                                               /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT7_Msk                     (_U_(0x1) << GPIO_LAT_LAT7_Pos)                      /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT7(value)                  (GPIO_LAT_LAT7_Msk & ((value) << GPIO_LAT_LAT7_Pos))
#define GPIO_LAT_LAT8_Pos                     _U_(8)                                               /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT8_Msk                     (_U_(0x1) << GPIO_LAT_LAT8_Pos)                      /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT8(value)                  (GPIO_LAT_LAT8_Msk & ((value) << GPIO_LAT_LAT8_Pos))
#define GPIO_LAT_LAT9_Pos                     _U_(9)                                               /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT9_Msk                     (_U_(0x1) << GPIO_LAT_LAT9_Pos)                      /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT9(value)                  (GPIO_LAT_LAT9_Msk & ((value) << GPIO_LAT_LAT9_Pos))
#define GPIO_LAT_LAT10_Pos                    _U_(10)                                              /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT10_Msk                    (_U_(0x1) << GPIO_LAT_LAT10_Pos)                     /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT10(value)                 (GPIO_LAT_LAT10_Msk & ((value) << GPIO_LAT_LAT10_Pos))
#define GPIO_LAT_LAT11_Pos                    _U_(11)                                              /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT11_Msk                    (_U_(0x1) << GPIO_LAT_LAT11_Pos)                     /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT11(value)                 (GPIO_LAT_LAT11_Msk & ((value) << GPIO_LAT_LAT11_Pos))
#define GPIO_LAT_LAT12_Pos                    _U_(12)                                              /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT12_Msk                    (_U_(0x1) << GPIO_LAT_LAT12_Pos)                     /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT12(value)                 (GPIO_LAT_LAT12_Msk & ((value) << GPIO_LAT_LAT12_Pos))
#define GPIO_LAT_LAT13_Pos                    _U_(13)                                              /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT13_Msk                    (_U_(0x1) << GPIO_LAT_LAT13_Pos)                     /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT13(value)                 (GPIO_LAT_LAT13_Msk & ((value) << GPIO_LAT_LAT13_Pos))
#define GPIO_LAT_LAT14_Pos                    _U_(14)                                              /**< (GPIO_LAT)  Position */
#define GPIO_LAT_LAT14_Msk                    (_U_(0x1) << GPIO_LAT_LAT14_Pos)                     /**< (GPIO_LAT)  Mask */
#define GPIO_LAT_LAT14(value)                 (GPIO_LAT_LAT14_Msk & ((value) << GPIO_LAT_LAT14_Pos))
#define GPIO_LAT_Msk                          _U_(0x00007FFF)                                      /**< (GPIO_LAT) Register Mask  */

#define GPIO_LAT_LAT_Pos                      _U_(0)                                               /**< (GPIO_LAT Position)  */
#define GPIO_LAT_LAT_Msk                      (_U_(0x7FFF) << GPIO_LAT_LAT_Pos)                    /**< (GPIO_LAT Mask) LAT */
#define GPIO_LAT_LAT(value)                   (GPIO_LAT_LAT_Msk & ((value) << GPIO_LAT_LAT_Pos))   

