Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/include/component/gpio.h
/* -------- GPIO_LATCLR : (GPIO Offset: 0x34) (R/W 32)  -------- */
#define GPIO_LATCLR_RESETVALUE                _U_(0x00)                                            /**<  (GPIO_LATCLR)   Reset Value */

#define GPIO_LATCLR_Msk                       _U_(0x00000000)                                      /**< (GPIO_LATCLR) Register Mask  */


/* -------- GPIO_LATSET : (GPIO Offset: 0x38) (R/W 32)  -------- */
#define GPIO_LATSET_RESETVALUE                _U_(0x00)                                            /**<  (GPIO_LATSET)   Reset Value */

#define GPIO_LATSET_Msk                       _U_(0x00000000)                                      /**< (GPIO_LATSET) Register Mask  */


/* -------- GPIO_LATINV : (GPIO Offset: 0x3C) (R/W 32)  -------- */
#define GPIO_LATINV_RESETVALUE                _U_(0x00)                                            /**<  (GPIO_LATINV)   Reset Value */

#define GPIO_LATINV_Msk                       _U_(0x00000000)                                      /**< (GPIO_LATINV) Register Mask  */


/* -------- GPIO_ODC : (GPIO Offset: 0x40) (R/W 32)  -------- */
#define GPIO_ODC_RESETVALUE                   _U_(0x00)                                            /**<  (GPIO_ODC)   Reset Value */

#define GPIO_ODC_ODC0_Pos                     _U_(0)                                               /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC0_Msk                     (_U_(0x1) << GPIO_ODC_ODC0_Pos)                      /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC0(value)                  (GPIO_ODC_ODC0_Msk & ((value) << GPIO_ODC_ODC0_Pos))
#define GPIO_ODC_ODC1_Pos                     _U_(1)                                               /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC1_Msk                     (_U_(0x1) << GPIO_ODC_ODC1_Pos)                      /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC1(value)                  (GPIO_ODC_ODC1_Msk & ((value) << GPIO_ODC_ODC1_Pos))
#define GPIO_ODC_ODC2_Pos                     _U_(2)                                               /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC2_Msk                     (_U_(0x1) << GPIO_ODC_ODC2_Pos)                      /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC2(value)                  (GPIO_ODC_ODC2_Msk & ((value) << GPIO_ODC_ODC2_Pos))
#define GPIO_ODC_ODC3_Pos                     _U_(3)                                               /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC3_Msk                     (_U_(0x1) << GPIO_ODC_ODC3_Pos)                      /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC3(value)                  (GPIO_ODC_ODC3_Msk & ((value) << GPIO_ODC_ODC3_Pos))
#define GPIO_ODC_ODC4_Pos                     _U_(4)                                               /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC4_Msk                     (_U_(0x1) << GPIO_ODC_ODC4_Pos)                      /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC4(value)                  (GPIO_ODC_ODC4_Msk & ((value) << GPIO_ODC_ODC4_Pos))
#define GPIO_ODC_ODC5_Pos                     _U_(5)                                               /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC5_Msk                     (_U_(0x1) << GPIO_ODC_ODC5_Pos)                      /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC5(value)                  (GPIO_ODC_ODC5_Msk & ((value) << GPIO_ODC_ODC5_Pos))
#define GPIO_ODC_ODC6_Pos                     _U_(6)                                               /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC6_Msk                     (_U_(0x1) << GPIO_ODC_ODC6_Pos)                      /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC6(value)                  (GPIO_ODC_ODC6_Msk & ((value) << GPIO_ODC_ODC6_Pos))
#define GPIO_ODC_ODC7_Pos                     _U_(7)                                               /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC7_Msk                     (_U_(0x1) << GPIO_ODC_ODC7_Pos)                      /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC7(value)                  (GPIO_ODC_ODC7_Msk & ((value) << GPIO_ODC_ODC7_Pos))
#define GPIO_ODC_ODC8_Pos                     _U_(8)                                               /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC8_Msk                     (_U_(0x1) << GPIO_ODC_ODC8_Pos)                      /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC8(value)                  (GPIO_ODC_ODC8_Msk & ((value) << GPIO_ODC_ODC8_Pos))
#define GPIO_ODC_ODC9_Pos                     _U_(9)                                               /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC9_Msk                     (_U_(0x1) << GPIO_ODC_ODC9_Pos)                      /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC9(value)                  (GPIO_ODC_ODC9_Msk & ((value) << GPIO_ODC_ODC9_Pos))
#define GPIO_ODC_ODC10_Pos                    _U_(10)                                              /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC10_Msk                    (_U_(0x1) << GPIO_ODC_ODC10_Pos)                     /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC10(value)                 (GPIO_ODC_ODC10_Msk & ((value) << GPIO_ODC_ODC10_Pos))
#define GPIO_ODC_ODC11_Pos                    _U_(11)                                              /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC11_Msk                    (_U_(0x1) << GPIO_ODC_ODC11_Pos)                     /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC11(value)                 (GPIO_ODC_ODC11_Msk & ((value) << GPIO_ODC_ODC11_Pos))
#define GPIO_ODC_ODC12_Pos                    _U_(12)                                              /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC12_Msk                    (_U_(0x1) << GPIO_ODC_ODC12_Pos)                     /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC12(value)                 (GPIO_ODC_ODC12_Msk & ((value) << GPIO_ODC_ODC12_Pos))
#define GPIO_ODC_ODC13_Pos                    _U_(13)                                              /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC13_Msk                    (_U_(0x1) << GPIO_ODC_ODC13_Pos)                     /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC13(value)                 (GPIO_ODC_ODC13_Msk & ((value) << GPIO_ODC_ODC13_Pos))
#define GPIO_ODC_ODC14_Pos                    _U_(14)                                              /**< (GPIO_ODC)  Position */
#define GPIO_ODC_ODC14_Msk                    (_U_(0x1) << GPIO_ODC_ODC14_Pos)                     /**< (GPIO_ODC)  Mask */
#define GPIO_ODC_ODC14(value)                 (GPIO_ODC_ODC14_Msk & ((value) << GPIO_ODC_ODC14_Pos))
#define GPIO_ODC_Msk                          _U_(0x00007FFF)                                      /**< (GPIO_ODC) Register Mask  */

#define GPIO_ODC_ODC_Pos                      _U_(0)                                               /**< (GPIO_ODC Position)  */
#define GPIO_ODC_ODC_Msk                      (_U_(0x7FFF) << GPIO_ODC_ODC_Pos)                    /**< (GPIO_ODC Mask) ODC */
#define GPIO_ODC_ODC(value)                   (GPIO_ODC_ODC_Msk & ((value) << GPIO_ODC_ODC_Pos))   

