Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/include/component/gpio.h
/* -------- GPIO_ODCCLR : (GPIO Offset: 0x44) (R/W 32)  -------- */
#define GPIO_ODCCLR_RESETVALUE                _U_(0x00)                                            /**<  (GPIO_ODCCLR)   Reset Value */

#define GPIO_ODCCLR_Msk                       _U_(0x00000000)                                      /**< (GPIO_ODCCLR) Register Mask  */


/* -------- GPIO_ODCSET : (GPIO Offset: 0x48) (R/W 32)  -------- */
#define GPIO_ODCSET_RESETVALUE                _U_(0x00)                                            /**<  (GPIO_ODCSET)   Reset Value */

#define GPIO_ODCSET_Msk                       _U_(0x00000000)                                      /**< (GPIO_ODCSET) Register Mask  */


/* -------- GPIO_ODCINV : (GPIO Offset: 0x4C) (R/W 32)  -------- */
#define GPIO_ODCINV_RESETVALUE                _U_(0x00)                                            /**<  (GPIO_ODCINV)   Reset Value */

#define GPIO_ODCINV_Msk                       _U_(0x00000000)                                      /**< (GPIO_ODCINV) Register Mask  */


/* -------- GPIO_CNPU : (GPIO Offset: 0x50) (R/W 32)  -------- */
#define GPIO_CNPU_RESETVALUE                  _U_(0x00)                                            /**<  (GPIO_CNPU)   Reset Value */

#define GPIO_CNPU_CNPU0_Pos                   _U_(0)                                               /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU0_Msk                   (_U_(0x1) << GPIO_CNPU_CNPU0_Pos)                    /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU0(value)                (GPIO_CNPU_CNPU0_Msk & ((value) << GPIO_CNPU_CNPU0_Pos))
#define GPIO_CNPU_CNPU1_Pos                   _U_(1)                                               /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU1_Msk                   (_U_(0x1) << GPIO_CNPU_CNPU1_Pos)                    /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU1(value)                (GPIO_CNPU_CNPU1_Msk & ((value) << GPIO_CNPU_CNPU1_Pos))
#define GPIO_CNPU_CNPU2_Pos                   _U_(2)                                               /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU2_Msk                   (_U_(0x1) << GPIO_CNPU_CNPU2_Pos)                    /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU2(value)                (GPIO_CNPU_CNPU2_Msk & ((value) << GPIO_CNPU_CNPU2_Pos))
#define GPIO_CNPU_CNPU3_Pos                   _U_(3)                                               /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU3_Msk                   (_U_(0x1) << GPIO_CNPU_CNPU3_Pos)                    /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU3(value)                (GPIO_CNPU_CNPU3_Msk & ((value) << GPIO_CNPU_CNPU3_Pos))
#define GPIO_CNPU_CNPU4_Pos                   _U_(4)                                               /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU4_Msk                   (_U_(0x1) << GPIO_CNPU_CNPU4_Pos)                    /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU4(value)                (GPIO_CNPU_CNPU4_Msk & ((value) << GPIO_CNPU_CNPU4_Pos))
#define GPIO_CNPU_CNPU5_Pos                   _U_(5)                                               /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU5_Msk                   (_U_(0x1) << GPIO_CNPU_CNPU5_Pos)                    /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU5(value)                (GPIO_CNPU_CNPU5_Msk & ((value) << GPIO_CNPU_CNPU5_Pos))
#define GPIO_CNPU_CNPU6_Pos                   _U_(6)                                               /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU6_Msk                   (_U_(0x1) << GPIO_CNPU_CNPU6_Pos)                    /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU6(value)                (GPIO_CNPU_CNPU6_Msk & ((value) << GPIO_CNPU_CNPU6_Pos))
#define GPIO_CNPU_CNPU7_Pos                   _U_(7)                                               /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU7_Msk                   (_U_(0x1) << GPIO_CNPU_CNPU7_Pos)                    /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU7(value)                (GPIO_CNPU_CNPU7_Msk & ((value) << GPIO_CNPU_CNPU7_Pos))
#define GPIO_CNPU_CNPU8_Pos                   _U_(8)                                               /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU8_Msk                   (_U_(0x1) << GPIO_CNPU_CNPU8_Pos)                    /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU8(value)                (GPIO_CNPU_CNPU8_Msk & ((value) << GPIO_CNPU_CNPU8_Pos))
#define GPIO_CNPU_CNPU9_Pos                   _U_(9)                                               /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU9_Msk                   (_U_(0x1) << GPIO_CNPU_CNPU9_Pos)                    /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU9(value)                (GPIO_CNPU_CNPU9_Msk & ((value) << GPIO_CNPU_CNPU9_Pos))
#define GPIO_CNPU_CNPU10_Pos                  _U_(10)                                              /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU10_Msk                  (_U_(0x1) << GPIO_CNPU_CNPU10_Pos)                   /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU10(value)               (GPIO_CNPU_CNPU10_Msk & ((value) << GPIO_CNPU_CNPU10_Pos))
#define GPIO_CNPU_CNPU11_Pos                  _U_(11)                                              /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU11_Msk                  (_U_(0x1) << GPIO_CNPU_CNPU11_Pos)                   /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU11(value)               (GPIO_CNPU_CNPU11_Msk & ((value) << GPIO_CNPU_CNPU11_Pos))
#define GPIO_CNPU_CNPU12_Pos                  _U_(12)                                              /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU12_Msk                  (_U_(0x1) << GPIO_CNPU_CNPU12_Pos)                   /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU12(value)               (GPIO_CNPU_CNPU12_Msk & ((value) << GPIO_CNPU_CNPU12_Pos))
#define GPIO_CNPU_CNPU13_Pos                  _U_(13)                                              /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU13_Msk                  (_U_(0x1) << GPIO_CNPU_CNPU13_Pos)                   /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU13(value)               (GPIO_CNPU_CNPU13_Msk & ((value) << GPIO_CNPU_CNPU13_Pos))
#define GPIO_CNPU_CNPU14_Pos                  _U_(14)                                              /**< (GPIO_CNPU)  Position */
#define GPIO_CNPU_CNPU14_Msk                  (_U_(0x1) << GPIO_CNPU_CNPU14_Pos)                   /**< (GPIO_CNPU)  Mask */
#define GPIO_CNPU_CNPU14(value)               (GPIO_CNPU_CNPU14_Msk & ((value) << GPIO_CNPU_CNPU14_Pos))
#define GPIO_CNPU_Msk                         _U_(0x00007FFF)                                      /**< (GPIO_CNPU) Register Mask  */

#define GPIO_CNPU_CNPU_Pos                    _U_(0)                                               /**< (GPIO_CNPU Position)  */
#define GPIO_CNPU_CNPU_Msk                    (_U_(0x7FFF) << GPIO_CNPU_CNPU_Pos)                  /**< (GPIO_CNPU Mask) CNPU */
#define GPIO_CNPU_CNPU(value)                 (GPIO_CNPU_CNPU_Msk & ((value) << GPIO_CNPU_CNPU_Pos)) 

/* -------- GPIO_CNPUCLR : (GPIO Offset: 0x54) (R/W 32)  -------- */
#define GPIO_CNPUCLR_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_CNPUCLR)   Reset Value */

