Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/include/component/gpio.h
#define GPIO_CNPUCLR_Msk                      _U_(0x00000000)                                      /**< (GPIO_CNPUCLR) Register Mask  */


/* -------- GPIO_CNPUSET : (GPIO Offset: 0x58) (R/W 32)  -------- */
#define GPIO_CNPUSET_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_CNPUSET)   Reset Value */

#define GPIO_CNPUSET_Msk                      _U_(0x00000000)                                      /**< (GPIO_CNPUSET) Register Mask  */


/* -------- GPIO_CNPUINV : (GPIO Offset: 0x5C) (R/W 32)  -------- */
#define GPIO_CNPUINV_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_CNPUINV)   Reset Value */

#define GPIO_CNPUINV_Msk                      _U_(0x00000000)                                      /**< (GPIO_CNPUINV) Register Mask  */


/* -------- GPIO_CNPD : (GPIO Offset: 0x60) (R/W 32)  -------- */
#define GPIO_CNPD_RESETVALUE                  _U_(0x00)                                            /**<  (GPIO_CNPD)   Reset Value */

#define GPIO_CNPD_CNPD0_Pos                   _U_(0)                                               /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD0_Msk                   (_U_(0x1) << GPIO_CNPD_CNPD0_Pos)                    /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD0(value)                (GPIO_CNPD_CNPD0_Msk & ((value) << GPIO_CNPD_CNPD0_Pos))
#define GPIO_CNPD_CNPD1_Pos                   _U_(1)                                               /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD1_Msk                   (_U_(0x1) << GPIO_CNPD_CNPD1_Pos)                    /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD1(value)                (GPIO_CNPD_CNPD1_Msk & ((value) << GPIO_CNPD_CNPD1_Pos))
#define GPIO_CNPD_CNPD2_Pos                   _U_(2)                                               /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD2_Msk                   (_U_(0x1) << GPIO_CNPD_CNPD2_Pos)                    /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD2(value)                (GPIO_CNPD_CNPD2_Msk & ((value) << GPIO_CNPD_CNPD2_Pos))
#define GPIO_CNPD_CNPD3_Pos                   _U_(3)                                               /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD3_Msk                   (_U_(0x1) << GPIO_CNPD_CNPD3_Pos)                    /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD3(value)                (GPIO_CNPD_CNPD3_Msk & ((value) << GPIO_CNPD_CNPD3_Pos))
#define GPIO_CNPD_CNPD4_Pos                   _U_(4)                                               /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD4_Msk                   (_U_(0x1) << GPIO_CNPD_CNPD4_Pos)                    /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD4(value)                (GPIO_CNPD_CNPD4_Msk & ((value) << GPIO_CNPD_CNPD4_Pos))
#define GPIO_CNPD_CNPD5_Pos                   _U_(5)                                               /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD5_Msk                   (_U_(0x1) << GPIO_CNPD_CNPD5_Pos)                    /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD5(value)                (GPIO_CNPD_CNPD5_Msk & ((value) << GPIO_CNPD_CNPD5_Pos))
#define GPIO_CNPD_CNPD6_Pos                   _U_(6)                                               /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD6_Msk                   (_U_(0x1) << GPIO_CNPD_CNPD6_Pos)                    /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD6(value)                (GPIO_CNPD_CNPD6_Msk & ((value) << GPIO_CNPD_CNPD6_Pos))
#define GPIO_CNPD_CNPD7_Pos                   _U_(7)                                               /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD7_Msk                   (_U_(0x1) << GPIO_CNPD_CNPD7_Pos)                    /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD7(value)                (GPIO_CNPD_CNPD7_Msk & ((value) << GPIO_CNPD_CNPD7_Pos))
#define GPIO_CNPD_CNPD8_Pos                   _U_(8)                                               /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD8_Msk                   (_U_(0x1) << GPIO_CNPD_CNPD8_Pos)                    /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD8(value)                (GPIO_CNPD_CNPD8_Msk & ((value) << GPIO_CNPD_CNPD8_Pos))
#define GPIO_CNPD_CNPD9_Pos                   _U_(9)                                               /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD9_Msk                   (_U_(0x1) << GPIO_CNPD_CNPD9_Pos)                    /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD9(value)                (GPIO_CNPD_CNPD9_Msk & ((value) << GPIO_CNPD_CNPD9_Pos))
#define GPIO_CNPD_CNPD10_Pos                  _U_(10)                                              /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD10_Msk                  (_U_(0x1) << GPIO_CNPD_CNPD10_Pos)                   /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD10(value)               (GPIO_CNPD_CNPD10_Msk & ((value) << GPIO_CNPD_CNPD10_Pos))
#define GPIO_CNPD_CNPD11_Pos                  _U_(11)                                              /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD11_Msk                  (_U_(0x1) << GPIO_CNPD_CNPD11_Pos)                   /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD11(value)               (GPIO_CNPD_CNPD11_Msk & ((value) << GPIO_CNPD_CNPD11_Pos))
#define GPIO_CNPD_CNPD12_Pos                  _U_(12)                                              /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD12_Msk                  (_U_(0x1) << GPIO_CNPD_CNPD12_Pos)                   /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD12(value)               (GPIO_CNPD_CNPD12_Msk & ((value) << GPIO_CNPD_CNPD12_Pos))
#define GPIO_CNPD_CNPD13_Pos                  _U_(13)                                              /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD13_Msk                  (_U_(0x1) << GPIO_CNPD_CNPD13_Pos)                   /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD13(value)               (GPIO_CNPD_CNPD13_Msk & ((value) << GPIO_CNPD_CNPD13_Pos))
#define GPIO_CNPD_CNPD14_Pos                  _U_(14)                                              /**< (GPIO_CNPD)  Position */
#define GPIO_CNPD_CNPD14_Msk                  (_U_(0x1) << GPIO_CNPD_CNPD14_Pos)                   /**< (GPIO_CNPD)  Mask */
#define GPIO_CNPD_CNPD14(value)               (GPIO_CNPD_CNPD14_Msk & ((value) << GPIO_CNPD_CNPD14_Pos))
#define GPIO_CNPD_Msk                         _U_(0x00007FFF)                                      /**< (GPIO_CNPD) Register Mask  */

