Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/include/component/gpio.h
#define GPIO_CNPD_CNPD_Pos                    _U_(0)                                               /**< (GPIO_CNPD Position)  */
#define GPIO_CNPD_CNPD_Msk                    (_U_(0x7FFF) << GPIO_CNPD_CNPD_Pos)                  /**< (GPIO_CNPD Mask) CNPD */
#define GPIO_CNPD_CNPD(value)                 (GPIO_CNPD_CNPD_Msk & ((value) << GPIO_CNPD_CNPD_Pos)) 

/* -------- GPIO_CNPDCLR : (GPIO Offset: 0x64) (R/W 32)  -------- */
#define GPIO_CNPDCLR_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_CNPDCLR)   Reset Value */

#define GPIO_CNPDCLR_Msk                      _U_(0x00000000)                                      /**< (GPIO_CNPDCLR) Register Mask  */


/* -------- GPIO_CNPDSET : (GPIO Offset: 0x68) (R/W 32)  -------- */
#define GPIO_CNPDSET_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_CNPDSET)   Reset Value */

#define GPIO_CNPDSET_Msk                      _U_(0x00000000)                                      /**< (GPIO_CNPDSET) Register Mask  */


/* -------- GPIO_CNPDINV : (GPIO Offset: 0x6C) (R/W 32)  -------- */
#define GPIO_CNPDINV_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_CNPDINV)   Reset Value */

#define GPIO_CNPDINV_Msk                      _U_(0x00000000)                                      /**< (GPIO_CNPDINV) Register Mask  */


/* -------- GPIO_CNCON : (GPIO Offset: 0x70) (R/W 32)  -------- */
#define GPIO_CNCON_RESETVALUE                 _U_(0x00)                                            /**<  (GPIO_CNCON)   Reset Value */

#define GPIO_CNCON_EDGEDETECT_Pos             _U_(11)                                              /**< (GPIO_CNCON)  Position */
#define GPIO_CNCON_EDGEDETECT_Msk             (_U_(0x1) << GPIO_CNCON_EDGEDETECT_Pos)              /**< (GPIO_CNCON)  Mask */
#define GPIO_CNCON_EDGEDETECT(value)          (GPIO_CNCON_EDGEDETECT_Msk & ((value) << GPIO_CNCON_EDGEDETECT_Pos))
#define GPIO_CNCON_SIDL_Pos                   _U_(13)                                              /**< (GPIO_CNCON)  Position */
#define GPIO_CNCON_SIDL_Msk                   (_U_(0x1) << GPIO_CNCON_SIDL_Pos)                    /**< (GPIO_CNCON)  Mask */
#define GPIO_CNCON_SIDL(value)                (GPIO_CNCON_SIDL_Msk & ((value) << GPIO_CNCON_SIDL_Pos))
#define GPIO_CNCON_FRZ_Pos                    _U_(14)                                              /**< (GPIO_CNCON)  Position */
#define GPIO_CNCON_FRZ_Msk                    (_U_(0x1) << GPIO_CNCON_FRZ_Pos)                     /**< (GPIO_CNCON)  Mask */
#define GPIO_CNCON_FRZ(value)                 (GPIO_CNCON_FRZ_Msk & ((value) << GPIO_CNCON_FRZ_Pos))
#define GPIO_CNCON_ON_Pos                     _U_(15)                                              /**< (GPIO_CNCON)  Position */
#define GPIO_CNCON_ON_Msk                     (_U_(0x1) << GPIO_CNCON_ON_Pos)                      /**< (GPIO_CNCON)  Mask */
#define GPIO_CNCON_ON(value)                  (GPIO_CNCON_ON_Msk & ((value) << GPIO_CNCON_ON_Pos))
#define GPIO_CNCON_Msk                        _U_(0x0000E800)                                      /**< (GPIO_CNCON) Register Mask  */


/* -------- GPIO_CNCONCLR : (GPIO Offset: 0x74) (R/W 32)  -------- */
#define GPIO_CNCONCLR_RESETVALUE              _U_(0x00)                                            /**<  (GPIO_CNCONCLR)   Reset Value */

#define GPIO_CNCONCLR_Msk                     _U_(0x00000000)                                      /**< (GPIO_CNCONCLR) Register Mask  */


/* -------- GPIO_CNCONSET : (GPIO Offset: 0x78) (R/W 32)  -------- */
#define GPIO_CNCONSET_RESETVALUE              _U_(0x00)                                            /**<  (GPIO_CNCONSET)   Reset Value */

#define GPIO_CNCONSET_Msk                     _U_(0x00000000)                                      /**< (GPIO_CNCONSET) Register Mask  */


/* -------- GPIO_CNCONINV : (GPIO Offset: 0x7C) (R/W 32)  -------- */
#define GPIO_CNCONINV_RESETVALUE              _U_(0x00)                                            /**<  (GPIO_CNCONINV)   Reset Value */

#define GPIO_CNCONINV_Msk                     _U_(0x00000000)                                      /**< (GPIO_CNCONINV) Register Mask  */


/* -------- GPIO_CNEN : (GPIO Offset: 0x80) (R/W 32)  -------- */
#define GPIO_CNEN_RESETVALUE                  _U_(0x00)                                            /**<  (GPIO_CNEN)   Reset Value */

#define GPIO_CNEN_CNIE0_Pos                   _U_(0)                                               /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE0_Msk                   (_U_(0x1) << GPIO_CNEN_CNIE0_Pos)                    /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE0(value)                (GPIO_CNEN_CNIE0_Msk & ((value) << GPIO_CNEN_CNIE0_Pos))
#define GPIO_CNEN_CNIE1_Pos                   _U_(1)                                               /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE1_Msk                   (_U_(0x1) << GPIO_CNEN_CNIE1_Pos)                    /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE1(value)                (GPIO_CNEN_CNIE1_Msk & ((value) << GPIO_CNEN_CNIE1_Pos))
#define GPIO_CNEN_CNIE2_Pos                   _U_(2)                                               /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE2_Msk                   (_U_(0x1) << GPIO_CNEN_CNIE2_Pos)                    /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE2(value)                (GPIO_CNEN_CNIE2_Msk & ((value) << GPIO_CNEN_CNIE2_Pos))
#define GPIO_CNEN_CNIE3_Pos                   _U_(3)                                               /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE3_Msk                   (_U_(0x1) << GPIO_CNEN_CNIE3_Pos)                    /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE3(value)                (GPIO_CNEN_CNIE3_Msk & ((value) << GPIO_CNEN_CNIE3_Pos))
#define GPIO_CNEN_CNIE4_Pos                   _U_(4)                                               /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE4_Msk                   (_U_(0x1) << GPIO_CNEN_CNIE4_Pos)                    /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE4(value)                (GPIO_CNEN_CNIE4_Msk & ((value) << GPIO_CNEN_CNIE4_Pos))
#define GPIO_CNEN_CNIE5_Pos                   _U_(5)                                               /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE5_Msk                   (_U_(0x1) << GPIO_CNEN_CNIE5_Pos)                    /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE5(value)                (GPIO_CNEN_CNIE5_Msk & ((value) << GPIO_CNEN_CNIE5_Pos))
#define GPIO_CNEN_CNIE6_Pos                   _U_(6)                                               /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE6_Msk                   (_U_(0x1) << GPIO_CNEN_CNIE6_Pos)                    /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE6(value)                (GPIO_CNEN_CNIE6_Msk & ((value) << GPIO_CNEN_CNIE6_Pos))
#define GPIO_CNEN_CNIE7_Pos                   _U_(7)                                               /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE7_Msk                   (_U_(0x1) << GPIO_CNEN_CNIE7_Pos)                    /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE7(value)                (GPIO_CNEN_CNIE7_Msk & ((value) << GPIO_CNEN_CNIE7_Pos))
#define GPIO_CNEN_CNIE8_Pos                   _U_(8)                                               /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE8_Msk                   (_U_(0x1) << GPIO_CNEN_CNIE8_Pos)                    /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE8(value)                (GPIO_CNEN_CNIE8_Msk & ((value) << GPIO_CNEN_CNIE8_Pos))
#define GPIO_CNEN_CNIE9_Pos                   _U_(9)                                               /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE9_Msk                   (_U_(0x1) << GPIO_CNEN_CNIE9_Pos)                    /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE9(value)                (GPIO_CNEN_CNIE9_Msk & ((value) << GPIO_CNEN_CNIE9_Pos))
#define GPIO_CNEN_CNIE10_Pos                  _U_(10)                                              /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE10_Msk                  (_U_(0x1) << GPIO_CNEN_CNIE10_Pos)                   /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE10(value)               (GPIO_CNEN_CNIE10_Msk & ((value) << GPIO_CNEN_CNIE10_Pos))
#define GPIO_CNEN_CNIE11_Pos                  _U_(11)                                              /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE11_Msk                  (_U_(0x1) << GPIO_CNEN_CNIE11_Pos)                   /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE11(value)               (GPIO_CNEN_CNIE11_Msk & ((value) << GPIO_CNEN_CNIE11_Pos))
#define GPIO_CNEN_CNIE12_Pos                  _U_(12)                                              /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE12_Msk                  (_U_(0x1) << GPIO_CNEN_CNIE12_Pos)                   /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE12(value)               (GPIO_CNEN_CNIE12_Msk & ((value) << GPIO_CNEN_CNIE12_Pos))
#define GPIO_CNEN_CNIE13_Pos                  _U_(13)                                              /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE13_Msk                  (_U_(0x1) << GPIO_CNEN_CNIE13_Pos)                   /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE13(value)               (GPIO_CNEN_CNIE13_Msk & ((value) << GPIO_CNEN_CNIE13_Pos))
#define GPIO_CNEN_CNIE14_Pos                  _U_(14)                                              /**< (GPIO_CNEN)  Position */
#define GPIO_CNEN_CNIE14_Msk                  (_U_(0x1) << GPIO_CNEN_CNIE14_Pos)                   /**< (GPIO_CNEN)  Mask */
#define GPIO_CNEN_CNIE14(value)               (GPIO_CNEN_CNIE14_Msk & ((value) << GPIO_CNEN_CNIE14_Pos))
#define GPIO_CNEN_Msk                         _U_(0x00007FFF)                                      /**< (GPIO_CNEN) Register Mask  */

