Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/include/component/gpio.h
#define GPIO_CNEN_CNIE_Pos                    _U_(0)                                               /**< (GPIO_CNEN Position)  */
#define GPIO_CNEN_CNIE_Msk                    (_U_(0x7FFF) << GPIO_CNEN_CNIE_Pos)                  /**< (GPIO_CNEN Mask) CNIE */
#define GPIO_CNEN_CNIE(value)                 (GPIO_CNEN_CNIE_Msk & ((value) << GPIO_CNEN_CNIE_Pos)) 

/* -------- GPIO_CNENCLR : (GPIO Offset: 0x84) (R/W 32)  -------- */
#define GPIO_CNENCLR_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_CNENCLR)   Reset Value */

#define GPIO_CNENCLR_Msk                      _U_(0x00000000)                                      /**< (GPIO_CNENCLR) Register Mask  */


/* -------- GPIO_CNENSET : (GPIO Offset: 0x88) (R/W 32)  -------- */
#define GPIO_CNENSET_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_CNENSET)   Reset Value */

#define GPIO_CNENSET_Msk                      _U_(0x00000000)                                      /**< (GPIO_CNENSET) Register Mask  */


/* -------- GPIO_CNENINV : (GPIO Offset: 0x8C) (R/W 32)  -------- */
#define GPIO_CNENINV_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_CNENINV)   Reset Value */

#define GPIO_CNENINV_Msk                      _U_(0x00000000)                                      /**< (GPIO_CNENINV) Register Mask  */


/* -------- GPIO_CNSTAT : (GPIO Offset: 0x90) (R/W 32)  -------- */
#define GPIO_CNSTAT_RESETVALUE                _U_(0x00)                                            /**<  (GPIO_CNSTAT)   Reset Value */

#define GPIO_CNSTAT_CNSTAT0_Pos               _U_(0)                                               /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT0_Msk               (_U_(0x1) << GPIO_CNSTAT_CNSTAT0_Pos)                /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT0(value)            (GPIO_CNSTAT_CNSTAT0_Msk & ((value) << GPIO_CNSTAT_CNSTAT0_Pos))
#define GPIO_CNSTAT_CNSTAT1_Pos               _U_(1)                                               /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT1_Msk               (_U_(0x1) << GPIO_CNSTAT_CNSTAT1_Pos)                /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT1(value)            (GPIO_CNSTAT_CNSTAT1_Msk & ((value) << GPIO_CNSTAT_CNSTAT1_Pos))
#define GPIO_CNSTAT_CNSTAT2_Pos               _U_(2)                                               /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT2_Msk               (_U_(0x1) << GPIO_CNSTAT_CNSTAT2_Pos)                /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT2(value)            (GPIO_CNSTAT_CNSTAT2_Msk & ((value) << GPIO_CNSTAT_CNSTAT2_Pos))
#define GPIO_CNSTAT_CNSTAT3_Pos               _U_(3)                                               /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT3_Msk               (_U_(0x1) << GPIO_CNSTAT_CNSTAT3_Pos)                /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT3(value)            (GPIO_CNSTAT_CNSTAT3_Msk & ((value) << GPIO_CNSTAT_CNSTAT3_Pos))
#define GPIO_CNSTAT_CNSTAT4_Pos               _U_(4)                                               /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT4_Msk               (_U_(0x1) << GPIO_CNSTAT_CNSTAT4_Pos)                /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT4(value)            (GPIO_CNSTAT_CNSTAT4_Msk & ((value) << GPIO_CNSTAT_CNSTAT4_Pos))
#define GPIO_CNSTAT_CNSTAT5_Pos               _U_(5)                                               /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT5_Msk               (_U_(0x1) << GPIO_CNSTAT_CNSTAT5_Pos)                /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT5(value)            (GPIO_CNSTAT_CNSTAT5_Msk & ((value) << GPIO_CNSTAT_CNSTAT5_Pos))
#define GPIO_CNSTAT_CNSTAT6_Pos               _U_(6)                                               /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT6_Msk               (_U_(0x1) << GPIO_CNSTAT_CNSTAT6_Pos)                /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT6(value)            (GPIO_CNSTAT_CNSTAT6_Msk & ((value) << GPIO_CNSTAT_CNSTAT6_Pos))
#define GPIO_CNSTAT_CNSTAT7_Pos               _U_(7)                                               /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT7_Msk               (_U_(0x1) << GPIO_CNSTAT_CNSTAT7_Pos)                /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT7(value)            (GPIO_CNSTAT_CNSTAT7_Msk & ((value) << GPIO_CNSTAT_CNSTAT7_Pos))
#define GPIO_CNSTAT_CNSTAT8_Pos               _U_(8)                                               /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT8_Msk               (_U_(0x1) << GPIO_CNSTAT_CNSTAT8_Pos)                /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT8(value)            (GPIO_CNSTAT_CNSTAT8_Msk & ((value) << GPIO_CNSTAT_CNSTAT8_Pos))
#define GPIO_CNSTAT_CNSTATA_Pos               _U_(9)                                               /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTATA_Msk               (_U_(0x1) << GPIO_CNSTAT_CNSTATA_Pos)                /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTATA(value)            (GPIO_CNSTAT_CNSTATA_Msk & ((value) << GPIO_CNSTAT_CNSTATA_Pos))
#define GPIO_CNSTAT_CNSTAT10_Pos              _U_(10)                                              /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT10_Msk              (_U_(0x1) << GPIO_CNSTAT_CNSTAT10_Pos)               /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT10(value)           (GPIO_CNSTAT_CNSTAT10_Msk & ((value) << GPIO_CNSTAT_CNSTAT10_Pos))
#define GPIO_CNSTAT_CNSTAT11_Pos              _U_(11)                                              /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT11_Msk              (_U_(0x1) << GPIO_CNSTAT_CNSTAT11_Pos)               /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT11(value)           (GPIO_CNSTAT_CNSTAT11_Msk & ((value) << GPIO_CNSTAT_CNSTAT11_Pos))
#define GPIO_CNSTAT_CNSTAT12_Pos              _U_(12)                                              /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT12_Msk              (_U_(0x1) << GPIO_CNSTAT_CNSTAT12_Pos)               /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT12(value)           (GPIO_CNSTAT_CNSTAT12_Msk & ((value) << GPIO_CNSTAT_CNSTAT12_Pos))
#define GPIO_CNSTAT_CNSTAT13_Pos              _U_(13)                                              /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT13_Msk              (_U_(0x1) << GPIO_CNSTAT_CNSTAT13_Pos)               /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT13(value)           (GPIO_CNSTAT_CNSTAT13_Msk & ((value) << GPIO_CNSTAT_CNSTAT13_Pos))
#define GPIO_CNSTAT_CNSTAT14_Pos              _U_(14)                                              /**< (GPIO_CNSTAT)  Position */
#define GPIO_CNSTAT_CNSTAT14_Msk              (_U_(0x1) << GPIO_CNSTAT_CNSTAT14_Pos)               /**< (GPIO_CNSTAT)  Mask */
#define GPIO_CNSTAT_CNSTAT14(value)           (GPIO_CNSTAT_CNSTAT14_Msk & ((value) << GPIO_CNSTAT_CNSTAT14_Pos))
#define GPIO_CNSTAT_Msk                       _U_(0x00007FFF)                                      /**< (GPIO_CNSTAT) Register Mask  */


/* -------- GPIO_CNSTATCLR : (GPIO Offset: 0x94) (R/W 32)  -------- */
#define GPIO_CNSTATCLR_RESETVALUE             _U_(0x00)                                            /**<  (GPIO_CNSTATCLR)   Reset Value */

#define GPIO_CNSTATCLR_Msk                    _U_(0x00000000)                                      /**< (GPIO_CNSTATCLR) Register Mask  */


