Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/include/component/gpio.h
/* -------- GPIO_CNSTATSET : (GPIO Offset: 0x98) (R/W 32)  -------- */
#define GPIO_CNSTATSET_RESETVALUE             _U_(0x00)                                            /**<  (GPIO_CNSTATSET)   Reset Value */

#define GPIO_CNSTATSET_Msk                    _U_(0x00000000)                                      /**< (GPIO_CNSTATSET) Register Mask  */


/* -------- GPIO_CNSTATINV : (GPIO Offset: 0x9C) (R/W 32)  -------- */
#define GPIO_CNSTATINV_RESETVALUE             _U_(0x00)                                            /**<  (GPIO_CNSTATINV)   Reset Value */

#define GPIO_CNSTATINV_Msk                    _U_(0x00000000)                                      /**< (GPIO_CNSTATINV) Register Mask  */


/* -------- GPIO_CNNE : (GPIO Offset: 0xA0) (R/W 32)  -------- */
#define GPIO_CNNE_RESETVALUE                  _U_(0x00)                                            /**<  (GPIO_CNNE)   Reset Value */

#define GPIO_CNNE_CNNE0_Pos                   _U_(0)                                               /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE0_Msk                   (_U_(0x1) << GPIO_CNNE_CNNE0_Pos)                    /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE0(value)                (GPIO_CNNE_CNNE0_Msk & ((value) << GPIO_CNNE_CNNE0_Pos))
#define GPIO_CNNE_CNNE1_Pos                   _U_(1)                                               /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE1_Msk                   (_U_(0x1) << GPIO_CNNE_CNNE1_Pos)                    /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE1(value)                (GPIO_CNNE_CNNE1_Msk & ((value) << GPIO_CNNE_CNNE1_Pos))
#define GPIO_CNNE_CNNE2_Pos                   _U_(2)                                               /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE2_Msk                   (_U_(0x1) << GPIO_CNNE_CNNE2_Pos)                    /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE2(value)                (GPIO_CNNE_CNNE2_Msk & ((value) << GPIO_CNNE_CNNE2_Pos))
#define GPIO_CNNE_CNNE3_Pos                   _U_(3)                                               /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE3_Msk                   (_U_(0x1) << GPIO_CNNE_CNNE3_Pos)                    /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE3(value)                (GPIO_CNNE_CNNE3_Msk & ((value) << GPIO_CNNE_CNNE3_Pos))
#define GPIO_CNNE_CNNE4_Pos                   _U_(4)                                               /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE4_Msk                   (_U_(0x1) << GPIO_CNNE_CNNE4_Pos)                    /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE4(value)                (GPIO_CNNE_CNNE4_Msk & ((value) << GPIO_CNNE_CNNE4_Pos))
#define GPIO_CNNE_CNNE5_Pos                   _U_(5)                                               /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE5_Msk                   (_U_(0x1) << GPIO_CNNE_CNNE5_Pos)                    /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE5(value)                (GPIO_CNNE_CNNE5_Msk & ((value) << GPIO_CNNE_CNNE5_Pos))
#define GPIO_CNNE_CNNE6_Pos                   _U_(6)                                               /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE6_Msk                   (_U_(0x1) << GPIO_CNNE_CNNE6_Pos)                    /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE6(value)                (GPIO_CNNE_CNNE6_Msk & ((value) << GPIO_CNNE_CNNE6_Pos))
#define GPIO_CNNE_CNNE7_Pos                   _U_(7)                                               /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE7_Msk                   (_U_(0x1) << GPIO_CNNE_CNNE7_Pos)                    /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE7(value)                (GPIO_CNNE_CNNE7_Msk & ((value) << GPIO_CNNE_CNNE7_Pos))
#define GPIO_CNNE_CNNE8_Pos                   _U_(8)                                               /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE8_Msk                   (_U_(0x1) << GPIO_CNNE_CNNE8_Pos)                    /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE8(value)                (GPIO_CNNE_CNNE8_Msk & ((value) << GPIO_CNNE_CNNE8_Pos))
#define GPIO_CNNE_CNNE9_Pos                   _U_(9)                                               /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE9_Msk                   (_U_(0x1) << GPIO_CNNE_CNNE9_Pos)                    /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE9(value)                (GPIO_CNNE_CNNE9_Msk & ((value) << GPIO_CNNE_CNNE9_Pos))
#define GPIO_CNNE_CNNE10_Pos                  _U_(10)                                              /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE10_Msk                  (_U_(0x1) << GPIO_CNNE_CNNE10_Pos)                   /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE10(value)               (GPIO_CNNE_CNNE10_Msk & ((value) << GPIO_CNNE_CNNE10_Pos))
#define GPIO_CNNE_CNNE11_Pos                  _U_(11)                                              /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE11_Msk                  (_U_(0x1) << GPIO_CNNE_CNNE11_Pos)                   /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE11(value)               (GPIO_CNNE_CNNE11_Msk & ((value) << GPIO_CNNE_CNNE11_Pos))
#define GPIO_CNNE_CNNE12_Pos                  _U_(12)                                              /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE12_Msk                  (_U_(0x1) << GPIO_CNNE_CNNE12_Pos)                   /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE12(value)               (GPIO_CNNE_CNNE12_Msk & ((value) << GPIO_CNNE_CNNE12_Pos))
#define GPIO_CNNE_CNNE13_Pos                  _U_(13)                                              /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE13_Msk                  (_U_(0x1) << GPIO_CNNE_CNNE13_Pos)                   /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE13(value)               (GPIO_CNNE_CNNE13_Msk & ((value) << GPIO_CNNE_CNNE13_Pos))
#define GPIO_CNNE_CNNE14_Pos                  _U_(14)                                              /**< (GPIO_CNNE)  Position */
#define GPIO_CNNE_CNNE14_Msk                  (_U_(0x1) << GPIO_CNNE_CNNE14_Pos)                   /**< (GPIO_CNNE)  Mask */
#define GPIO_CNNE_CNNE14(value)               (GPIO_CNNE_CNNE14_Msk & ((value) << GPIO_CNNE_CNNE14_Pos))
#define GPIO_CNNE_Msk                         _U_(0x00007FFF)                                      /**< (GPIO_CNNE) Register Mask  */

#define GPIO_CNNE_CNNE_Pos                    _U_(0)                                               /**< (GPIO_CNNE Position)  */
#define GPIO_CNNE_CNNE_Msk                    (_U_(0x7FFF) << GPIO_CNNE_CNNE_Pos)                  /**< (GPIO_CNNE Mask) CNNE */
#define GPIO_CNNE_CNNE(value)                 (GPIO_CNNE_CNNE_Msk & ((value) << GPIO_CNNE_CNNE_Pos)) 

