Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/include/component/gpio.h
/* -------- GPIO_CNNECLR : (GPIO Offset: 0xA4) (R/W 32)  -------- */
#define GPIO_CNNECLR_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_CNNECLR)   Reset Value */

#define GPIO_CNNECLR_Msk                      _U_(0x00000000)                                      /**< (GPIO_CNNECLR) Register Mask  */


/* -------- GPIO_CNNESET : (GPIO Offset: 0xA8) (R/W 32)  -------- */
#define GPIO_CNNESET_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_CNNESET)   Reset Value */

#define GPIO_CNNESET_Msk                      _U_(0x00000000)                                      /**< (GPIO_CNNESET) Register Mask  */


/* -------- GPIO_CNNEINV : (GPIO Offset: 0xAC) (R/W 32)  -------- */
#define GPIO_CNNEINV_RESETVALUE               _U_(0x00)                                            /**<  (GPIO_CNNEINV)   Reset Value */

#define GPIO_CNNEINV_Msk                      _U_(0x00000000)                                      /**< (GPIO_CNNEINV) Register Mask  */


/* -------- GPIO_CNF : (GPIO Offset: 0xB0) (R/W 32)  -------- */
#define GPIO_CNF_RESETVALUE                   _U_(0x00)                                            /**<  (GPIO_CNF)   Reset Value */

#define GPIO_CNF_CNF0_Pos                     _U_(0)                                               /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF0_Msk                     (_U_(0x1) << GPIO_CNF_CNF0_Pos)                      /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF0(value)                  (GPIO_CNF_CNF0_Msk & ((value) << GPIO_CNF_CNF0_Pos))
#define GPIO_CNF_CNF1_Pos                     _U_(1)                                               /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF1_Msk                     (_U_(0x1) << GPIO_CNF_CNF1_Pos)                      /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF1(value)                  (GPIO_CNF_CNF1_Msk & ((value) << GPIO_CNF_CNF1_Pos))
#define GPIO_CNF_CNF2_Pos                     _U_(2)                                               /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF2_Msk                     (_U_(0x1) << GPIO_CNF_CNF2_Pos)                      /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF2(value)                  (GPIO_CNF_CNF2_Msk & ((value) << GPIO_CNF_CNF2_Pos))
#define GPIO_CNF_CNF3_Pos                     _U_(3)                                               /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF3_Msk                     (_U_(0x1) << GPIO_CNF_CNF3_Pos)                      /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF3(value)                  (GPIO_CNF_CNF3_Msk & ((value) << GPIO_CNF_CNF3_Pos))
#define GPIO_CNF_CNF4_Pos                     _U_(4)                                               /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF4_Msk                     (_U_(0x1) << GPIO_CNF_CNF4_Pos)                      /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF4(value)                  (GPIO_CNF_CNF4_Msk & ((value) << GPIO_CNF_CNF4_Pos))
#define GPIO_CNF_CNF5_Pos                     _U_(5)                                               /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF5_Msk                     (_U_(0x1) << GPIO_CNF_CNF5_Pos)                      /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF5(value)                  (GPIO_CNF_CNF5_Msk & ((value) << GPIO_CNF_CNF5_Pos))
#define GPIO_CNF_CNF6_Pos                     _U_(6)                                               /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF6_Msk                     (_U_(0x1) << GPIO_CNF_CNF6_Pos)                      /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF6(value)                  (GPIO_CNF_CNF6_Msk & ((value) << GPIO_CNF_CNF6_Pos))
#define GPIO_CNF_CNF7_Pos                     _U_(7)                                               /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF7_Msk                     (_U_(0x1) << GPIO_CNF_CNF7_Pos)                      /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF7(value)                  (GPIO_CNF_CNF7_Msk & ((value) << GPIO_CNF_CNF7_Pos))
#define GPIO_CNF_CNF8_Pos                     _U_(8)                                               /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF8_Msk                     (_U_(0x1) << GPIO_CNF_CNF8_Pos)                      /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF8(value)                  (GPIO_CNF_CNF8_Msk & ((value) << GPIO_CNF_CNF8_Pos))
#define GPIO_CNF_CNF9_Pos                     _U_(9)                                               /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF9_Msk                     (_U_(0x1) << GPIO_CNF_CNF9_Pos)                      /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF9(value)                  (GPIO_CNF_CNF9_Msk & ((value) << GPIO_CNF_CNF9_Pos))
#define GPIO_CNF_CNF10_Pos                    _U_(10)                                              /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF10_Msk                    (_U_(0x1) << GPIO_CNF_CNF10_Pos)                     /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF10(value)                 (GPIO_CNF_CNF10_Msk & ((value) << GPIO_CNF_CNF10_Pos))
#define GPIO_CNF_CNF11_Pos                    _U_(11)                                              /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF11_Msk                    (_U_(0x1) << GPIO_CNF_CNF11_Pos)                     /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF11(value)                 (GPIO_CNF_CNF11_Msk & ((value) << GPIO_CNF_CNF11_Pos))
#define GPIO_CNF_CNF12_Pos                    _U_(12)                                              /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF12_Msk                    (_U_(0x1) << GPIO_CNF_CNF12_Pos)                     /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF12(value)                 (GPIO_CNF_CNF12_Msk & ((value) << GPIO_CNF_CNF12_Pos))
#define GPIO_CNF_CNF13_Pos                    _U_(13)                                              /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF13_Msk                    (_U_(0x1) << GPIO_CNF_CNF13_Pos)                     /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF13(value)                 (GPIO_CNF_CNF13_Msk & ((value) << GPIO_CNF_CNF13_Pos))
#define GPIO_CNF_CNF14_Pos                    _U_(14)                                              /**< (GPIO_CNF)  Position */
#define GPIO_CNF_CNF14_Msk                    (_U_(0x1) << GPIO_CNF_CNF14_Pos)                     /**< (GPIO_CNF)  Mask */
#define GPIO_CNF_CNF14(value)                 (GPIO_CNF_CNF14_Msk & ((value) << GPIO_CNF_CNF14_Pos))
#define GPIO_CNF_Msk                          _U_(0x00007FFF)                                      /**< (GPIO_CNF) Register Mask  */

#define GPIO_CNF_CNF_Pos                      _U_(0)                                               /**< (GPIO_CNF Position)  */
#define GPIO_CNF_CNF_Msk                      (_U_(0x7FFF) << GPIO_CNF_CNF_Pos)                    /**< (GPIO_CNF Mask) CNF */
#define GPIO_CNF_CNF(value)                   (GPIO_CNF_CNF_Msk & ((value) << GPIO_CNF_CNF_Pos))   

/* -------- GPIO_CNFCLR : (GPIO Offset: 0xB4) (R/W 32)  -------- */
#define GPIO_CNFCLR_RESETVALUE                _U_(0x00)                                            /**<  (GPIO_CNFCLR)   Reset Value */

#define GPIO_CNFCLR_Msk                       _U_(0x00000000)                                      /**< (GPIO_CNFCLR) Register Mask  */


/* -------- GPIO_CNFSET : (GPIO Offset: 0xB8) (R/W 32)  -------- */
#define GPIO_CNFSET_RESETVALUE                _U_(0x00)                                            /**<  (GPIO_CNFSET)   Reset Value */

#define GPIO_CNFSET_Msk                       _U_(0x00000000)                                      /**< (GPIO_CNFSET) Register Mask  */


/* -------- GPIO_CNFINV : (GPIO Offset: 0xBC) (R/W 32)  -------- */
#define GPIO_CNFINV_RESETVALUE                _U_(0x00)                                            /**<  (GPIO_CNFINV)   Reset Value */

#define GPIO_CNFINV_Msk                       _U_(0x00000000)                                      /**< (GPIO_CNFINV) Register Mask  */


/* -------- GPIO_SRCON0 : (GPIO Offset: 0xC0) (R/W 32)  -------- */
#define GPIO_SRCON0_RESETVALUE                _U_(0x00)                                            /**<  (GPIO_SRCON0)   Reset Value */

