Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/include/component/gpio.h
#define GPIO_SRCON0_SR00_Pos                  _U_(0)                                               /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR00_Msk                  (_U_(0x1) << GPIO_SRCON0_SR00_Pos)                   /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR00(value)               (GPIO_SRCON0_SR00_Msk & ((value) << GPIO_SRCON0_SR00_Pos))
#define GPIO_SRCON0_SR01_Pos                  _U_(1)                                               /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR01_Msk                  (_U_(0x1) << GPIO_SRCON0_SR01_Pos)                   /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR01(value)               (GPIO_SRCON0_SR01_Msk & ((value) << GPIO_SRCON0_SR01_Pos))
#define GPIO_SRCON0_SR02_Pos                  _U_(2)                                               /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR02_Msk                  (_U_(0x1) << GPIO_SRCON0_SR02_Pos)                   /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR02(value)               (GPIO_SRCON0_SR02_Msk & ((value) << GPIO_SRCON0_SR02_Pos))
#define GPIO_SRCON0_SR03_Pos                  _U_(3)                                               /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR03_Msk                  (_U_(0x1) << GPIO_SRCON0_SR03_Pos)                   /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR03(value)               (GPIO_SRCON0_SR03_Msk & ((value) << GPIO_SRCON0_SR03_Pos))
#define GPIO_SRCON0_SR04_Pos                  _U_(4)                                               /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR04_Msk                  (_U_(0x1) << GPIO_SRCON0_SR04_Pos)                   /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR04(value)               (GPIO_SRCON0_SR04_Msk & ((value) << GPIO_SRCON0_SR04_Pos))
#define GPIO_SRCON0_SR05_Pos                  _U_(5)                                               /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR05_Msk                  (_U_(0x1) << GPIO_SRCON0_SR05_Pos)                   /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR05(value)               (GPIO_SRCON0_SR05_Msk & ((value) << GPIO_SRCON0_SR05_Pos))
#define GPIO_SRCON0_SR06_Pos                  _U_(6)                                               /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR06_Msk                  (_U_(0x1) << GPIO_SRCON0_SR06_Pos)                   /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR06(value)               (GPIO_SRCON0_SR06_Msk & ((value) << GPIO_SRCON0_SR06_Pos))
#define GPIO_SRCON0_SR07_Pos                  _U_(7)                                               /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR07_Msk                  (_U_(0x1) << GPIO_SRCON0_SR07_Pos)                   /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR07(value)               (GPIO_SRCON0_SR07_Msk & ((value) << GPIO_SRCON0_SR07_Pos))
#define GPIO_SRCON0_SR08_Pos                  _U_(8)                                               /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR08_Msk                  (_U_(0x1) << GPIO_SRCON0_SR08_Pos)                   /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR08(value)               (GPIO_SRCON0_SR08_Msk & ((value) << GPIO_SRCON0_SR08_Pos))
#define GPIO_SRCON0_SR09_Pos                  _U_(9)                                               /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR09_Msk                  (_U_(0x1) << GPIO_SRCON0_SR09_Pos)                   /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR09(value)               (GPIO_SRCON0_SR09_Msk & ((value) << GPIO_SRCON0_SR09_Pos))
#define GPIO_SRCON0_SR010_Pos                 _U_(10)                                              /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR010_Msk                 (_U_(0x1) << GPIO_SRCON0_SR010_Pos)                  /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR010(value)              (GPIO_SRCON0_SR010_Msk & ((value) << GPIO_SRCON0_SR010_Pos))
#define GPIO_SRCON0_SR011_Pos                 _U_(11)                                              /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR011_Msk                 (_U_(0x1) << GPIO_SRCON0_SR011_Pos)                  /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR011(value)              (GPIO_SRCON0_SR011_Msk & ((value) << GPIO_SRCON0_SR011_Pos))
#define GPIO_SRCON0_SR012_Pos                 _U_(12)                                              /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR012_Msk                 (_U_(0x1) << GPIO_SRCON0_SR012_Pos)                  /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR012(value)              (GPIO_SRCON0_SR012_Msk & ((value) << GPIO_SRCON0_SR012_Pos))
#define GPIO_SRCON0_SR013_Pos                 _U_(13)                                              /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR013_Msk                 (_U_(0x1) << GPIO_SRCON0_SR013_Pos)                  /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR013(value)              (GPIO_SRCON0_SR013_Msk & ((value) << GPIO_SRCON0_SR013_Pos))
#define GPIO_SRCON0_SR014_Pos                 _U_(14)                                              /**< (GPIO_SRCON0)  Position */
#define GPIO_SRCON0_SR014_Msk                 (_U_(0x1) << GPIO_SRCON0_SR014_Pos)                  /**< (GPIO_SRCON0)  Mask */
#define GPIO_SRCON0_SR014(value)              (GPIO_SRCON0_SR014_Msk & ((value) << GPIO_SRCON0_SR014_Pos))
#define GPIO_SRCON0_Msk                       _U_(0x00007FFF)                                      /**< (GPIO_SRCON0) Register Mask  */

#define GPIO_SRCON0_SR_Pos                    _U_(0)                                               /**< (GPIO_SRCON0 Position)  */
#define GPIO_SRCON0_SR_Msk                    (_U_(0x7FFF) << GPIO_SRCON0_SR_Pos)                  /**< (GPIO_SRCON0 Mask) SR */
#define GPIO_SRCON0_SR(value)                 (GPIO_SRCON0_SR_Msk & ((value) << GPIO_SRCON0_SR_Pos)) 

/* -------- GPIO_SRCON0CLR : (GPIO Offset: 0xC4) (R/W 32)  -------- */
#define GPIO_SRCON0CLR_RESETVALUE             _U_(0x00)                                            /**<  (GPIO_SRCON0CLR)   Reset Value */

#define GPIO_SRCON0CLR_Msk                    _U_(0x00000000)                                      /**< (GPIO_SRCON0CLR) Register Mask  */


/* -------- GPIO_SRCON0SET : (GPIO Offset: 0xC8) (R/W 32)  -------- */
#define GPIO_SRCON0SET_RESETVALUE             _U_(0x00)                                            /**<  (GPIO_SRCON0SET)   Reset Value */

#define GPIO_SRCON0SET_Msk                    _U_(0x00000000)                                      /**< (GPIO_SRCON0SET) Register Mask  */


/* -------- GPIO_SRCON0INV : (GPIO Offset: 0xCC) (R/W 32)  -------- */
#define GPIO_SRCON0INV_RESETVALUE             _U_(0x00)                                            /**<  (GPIO_SRCON0INV)   Reset Value */

#define GPIO_SRCON0INV_Msk                    _U_(0x00000000)                                      /**< (GPIO_SRCON0INV) Register Mask  */


/* -------- GPIO_SRCON1 : (GPIO Offset: 0xD0) (R/W 32)  -------- */
#define GPIO_SRCON1_RESETVALUE                _U_(0x00)                                            /**<  (GPIO_SRCON1)   Reset Value */

#define GPIO_SRCON1_SR10_Pos                  _U_(0)                                               /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR10_Msk                  (_U_(0x1) << GPIO_SRCON1_SR10_Pos)                   /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR10(value)               (GPIO_SRCON1_SR10_Msk & ((value) << GPIO_SRCON1_SR10_Pos))
#define GPIO_SRCON1_SR11_Pos                  _U_(1)                                               /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR11_Msk                  (_U_(0x1) << GPIO_SRCON1_SR11_Pos)                   /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR11(value)               (GPIO_SRCON1_SR11_Msk & ((value) << GPIO_SRCON1_SR11_Pos))
#define GPIO_SRCON1_SR12_Pos                  _U_(2)                                               /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR12_Msk                  (_U_(0x1) << GPIO_SRCON1_SR12_Pos)                   /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR12(value)               (GPIO_SRCON1_SR12_Msk & ((value) << GPIO_SRCON1_SR12_Pos))
#define GPIO_SRCON1_SR13_Pos                  _U_(3)                                               /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR13_Msk                  (_U_(0x1) << GPIO_SRCON1_SR13_Pos)                   /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR13(value)               (GPIO_SRCON1_SR13_Msk & ((value) << GPIO_SRCON1_SR13_Pos))
#define GPIO_SRCON1_SR14_Pos                  _U_(4)                                               /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR14_Msk                  (_U_(0x1) << GPIO_SRCON1_SR14_Pos)                   /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR14(value)               (GPIO_SRCON1_SR14_Msk & ((value) << GPIO_SRCON1_SR14_Pos))
#define GPIO_SRCON1_SR15_Pos                  _U_(5)                                               /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR15_Msk                  (_U_(0x1) << GPIO_SRCON1_SR15_Pos)                   /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR15(value)               (GPIO_SRCON1_SR15_Msk & ((value) << GPIO_SRCON1_SR15_Pos))
#define GPIO_SRCON1_SR16_Pos                  _U_(6)                                               /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR16_Msk                  (_U_(0x1) << GPIO_SRCON1_SR16_Pos)                   /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR16(value)               (GPIO_SRCON1_SR16_Msk & ((value) << GPIO_SRCON1_SR16_Pos))
#define GPIO_SRCON1_SR17_Pos                  _U_(7)                                               /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR17_Msk                  (_U_(0x1) << GPIO_SRCON1_SR17_Pos)                   /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR17(value)               (GPIO_SRCON1_SR17_Msk & ((value) << GPIO_SRCON1_SR17_Pos))
#define GPIO_SRCON1_SR18_Pos                  _U_(8)                                               /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR18_Msk                  (_U_(0x1) << GPIO_SRCON1_SR18_Pos)                   /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR18(value)               (GPIO_SRCON1_SR18_Msk & ((value) << GPIO_SRCON1_SR18_Pos))
#define GPIO_SRCON1_SR19_Pos                  _U_(9)                                               /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR19_Msk                  (_U_(0x1) << GPIO_SRCON1_SR19_Pos)                   /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR19(value)               (GPIO_SRCON1_SR19_Msk & ((value) << GPIO_SRCON1_SR19_Pos))
#define GPIO_SRCON1_SR110_Pos                 _U_(10)                                              /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR110_Msk                 (_U_(0x1) << GPIO_SRCON1_SR110_Pos)                  /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR110(value)              (GPIO_SRCON1_SR110_Msk & ((value) << GPIO_SRCON1_SR110_Pos))
#define GPIO_SRCON1_SR111_Pos                 _U_(11)                                              /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR111_Msk                 (_U_(0x1) << GPIO_SRCON1_SR111_Pos)                  /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR111(value)              (GPIO_SRCON1_SR111_Msk & ((value) << GPIO_SRCON1_SR111_Pos))
#define GPIO_SRCON1_SR112_Pos                 _U_(12)                                              /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR112_Msk                 (_U_(0x1) << GPIO_SRCON1_SR112_Pos)                  /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR112(value)              (GPIO_SRCON1_SR112_Msk & ((value) << GPIO_SRCON1_SR112_Pos))
#define GPIO_SRCON1_SR113_Pos                 _U_(13)                                              /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR113_Msk                 (_U_(0x1) << GPIO_SRCON1_SR113_Pos)                  /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR113(value)              (GPIO_SRCON1_SR113_Msk & ((value) << GPIO_SRCON1_SR113_Pos))
#define GPIO_SRCON1_SR114_Pos                 _U_(14)                                              /**< (GPIO_SRCON1)  Position */
#define GPIO_SRCON1_SR114_Msk                 (_U_(0x1) << GPIO_SRCON1_SR114_Pos)                  /**< (GPIO_SRCON1)  Mask */
#define GPIO_SRCON1_SR114(value)              (GPIO_SRCON1_SR114_Msk & ((value) << GPIO_SRCON1_SR114_Pos))
#define GPIO_SRCON1_Msk                       _U_(0x00007FFF)                                      /**< (GPIO_SRCON1) Register Mask  */

