Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ_DFP/1.0.43/BZ24/include/component/gpio.h
#define GPIO_SRCON1_SR_Pos                    _U_(0)                                               /**< (GPIO_SRCON1 Position)  */
#define GPIO_SRCON1_SR_Msk                    (_U_(0x7FFF) << GPIO_SRCON1_SR_Pos)                  /**< (GPIO_SRCON1 Mask) SR */
#define GPIO_SRCON1_SR(value)                 (GPIO_SRCON1_SR_Msk & ((value) << GPIO_SRCON1_SR_Pos)) 

/* -------- GPIO_SRCON1CLR : (GPIO Offset: 0xD4) (R/W 32)  -------- */
#define GPIO_SRCON1CLR_RESETVALUE             _U_(0x00)                                            /**<  (GPIO_SRCON1CLR)   Reset Value */

#define GPIO_SRCON1CLR_Msk                    _U_(0x00000000)                                      /**< (GPIO_SRCON1CLR) Register Mask  */


/* -------- GPIO_SRCON1SET : (GPIO Offset: 0xD8) (R/W 32)  -------- */
#define GPIO_SRCON1SET_RESETVALUE             _U_(0x00)                                            /**<  (GPIO_SRCON1SET)   Reset Value */

#define GPIO_SRCON1SET_Msk                    _U_(0x00000000)                                      /**< (GPIO_SRCON1SET) Register Mask  */


/* -------- GPIO_SRCON1INV : (GPIO Offset: 0xDC) (R/W 32)  -------- */
#define GPIO_SRCON1INV_RESETVALUE             _U_(0x00)                                            /**<  (GPIO_SRCON1INV)   Reset Value */

#define GPIO_SRCON1INV_Msk                    _U_(0x00000000)                                      /**< (GPIO_SRCON1INV) Register Mask  */


/** \brief GPIO register offsets definitions */
#define GPIO_ANSEL_REG_OFST            (0x00)              /**< (GPIO_ANSEL)  Offset */
#define GPIO_ANSELCLR_REG_OFST         (0x04)              /**< (GPIO_ANSELCLR)  Offset */
#define GPIO_ANSELSET_REG_OFST         (0x08)              /**< (GPIO_ANSELSET)  Offset */
#define GPIO_ANSELINV_REG_OFST         (0x0C)              /**< (GPIO_ANSELINV)  Offset */
#define GPIO_TRIS_REG_OFST             (0x10)              /**< (GPIO_TRIS)  Offset */
#define GPIO_TRISCLR_REG_OFST          (0x14)              /**< (GPIO_TRISCLR)  Offset */
#define GPIO_TRISSET_REG_OFST          (0x18)              /**< (GPIO_TRISSET)  Offset */
#define GPIO_TRISINV_REG_OFST          (0x1C)              /**< (GPIO_TRISINV)  Offset */
#define GPIO_PORT_REG_OFST             (0x20)              /**< (GPIO_PORT)  Offset */
#define GPIO_PORTCLR_REG_OFST          (0x24)              /**< (GPIO_PORTCLR)  Offset */
#define GPIO_PORTSET_REG_OFST          (0x28)              /**< (GPIO_PORTSET)  Offset */
#define GPIO_PORTINV_REG_OFST          (0x2C)              /**< (GPIO_PORTINV)  Offset */
#define GPIO_LAT_REG_OFST              (0x30)              /**< (GPIO_LAT)  Offset */
#define GPIO_LATCLR_REG_OFST           (0x34)              /**< (GPIO_LATCLR)  Offset */
#define GPIO_LATSET_REG_OFST           (0x38)              /**< (GPIO_LATSET)  Offset */
#define GPIO_LATINV_REG_OFST           (0x3C)              /**< (GPIO_LATINV)  Offset */
#define GPIO_ODC_REG_OFST              (0x40)              /**< (GPIO_ODC)  Offset */
#define GPIO_ODCCLR_REG_OFST           (0x44)              /**< (GPIO_ODCCLR)  Offset */
#define GPIO_ODCSET_REG_OFST           (0x48)              /**< (GPIO_ODCSET)  Offset */
#define GPIO_ODCINV_REG_OFST           (0x4C)              /**< (GPIO_ODCINV)  Offset */
#define GPIO_CNPU_REG_OFST             (0x50)              /**< (GPIO_CNPU)  Offset */
#define GPIO_CNPUCLR_REG_OFST          (0x54)              /**< (GPIO_CNPUCLR)  Offset */
#define GPIO_CNPUSET_REG_OFST          (0x58)              /**< (GPIO_CNPUSET)  Offset */
#define GPIO_CNPUINV_REG_OFST          (0x5C)              /**< (GPIO_CNPUINV)  Offset */
#define GPIO_CNPD_REG_OFST             (0x60)              /**< (GPIO_CNPD)  Offset */
#define GPIO_CNPDCLR_REG_OFST          (0x64)              /**< (GPIO_CNPDCLR)  Offset */
#define GPIO_CNPDSET_REG_OFST          (0x68)              /**< (GPIO_CNPDSET)  Offset */
#define GPIO_CNPDINV_REG_OFST          (0x6C)              /**< (GPIO_CNPDINV)  Offset */
#define GPIO_CNCON_REG_OFST            (0x70)              /**< (GPIO_CNCON)  Offset */
#define GPIO_CNCONCLR_REG_OFST         (0x74)              /**< (GPIO_CNCONCLR)  Offset */
#define GPIO_CNCONSET_REG_OFST         (0x78)              /**< (GPIO_CNCONSET)  Offset */
#define GPIO_CNCONINV_REG_OFST         (0x7C)              /**< (GPIO_CNCONINV)  Offset */
#define GPIO_CNEN_REG_OFST             (0x80)              /**< (GPIO_CNEN)  Offset */
#define GPIO_CNENCLR_REG_OFST          (0x84)              /**< (GPIO_CNENCLR)  Offset */
#define GPIO_CNENSET_REG_OFST          (0x88)              /**< (GPIO_CNENSET)  Offset */
#define GPIO_CNENINV_REG_OFST          (0x8C)              /**< (GPIO_CNENINV)  Offset */
#define GPIO_CNSTAT_REG_OFST           (0x90)              /**< (GPIO_CNSTAT)  Offset */
#define GPIO_CNSTATCLR_REG_OFST        (0x94)              /**< (GPIO_CNSTATCLR)  Offset */
#define GPIO_CNSTATSET_REG_OFST        (0x98)              /**< (GPIO_CNSTATSET)  Offset */
#define GPIO_CNSTATINV_REG_OFST        (0x9C)              /**< (GPIO_CNSTATINV)  Offset */
#define GPIO_CNNE_REG_OFST             (0xA0)              /**< (GPIO_CNNE)  Offset */
#define GPIO_CNNECLR_REG_OFST          (0xA4)              /**< (GPIO_CNNECLR)  Offset */
#define GPIO_CNNESET_REG_OFST          (0xA8)              /**< (GPIO_CNNESET)  Offset */
#define GPIO_CNNEINV_REG_OFST          (0xAC)              /**< (GPIO_CNNEINV)  Offset */
#define GPIO_CNF_REG_OFST              (0xB0)              /**< (GPIO_CNF)  Offset */
#define GPIO_CNFCLR_REG_OFST           (0xB4)              /**< (GPIO_CNFCLR)  Offset */
#define GPIO_CNFSET_REG_OFST           (0xB8)              /**< (GPIO_CNFSET)  Offset */
#define GPIO_CNFINV_REG_OFST           (0xBC)              /**< (GPIO_CNFINV)  Offset */
#define GPIO_SRCON0_REG_OFST           (0xC0)              /**< (GPIO_SRCON0)  Offset */
#define GPIO_SRCON0CLR_REG_OFST        (0xC4)              /**< (GPIO_SRCON0CLR)  Offset */
#define GPIO_SRCON0SET_REG_OFST        (0xC8)              /**< (GPIO_SRCON0SET)  Offset */
#define GPIO_SRCON0INV_REG_OFST        (0xCC)              /**< (GPIO_SRCON0INV)  Offset */
#define GPIO_SRCON1_REG_OFST           (0xD0)              /**< (GPIO_SRCON1)  Offset */
#define GPIO_SRCON1CLR_REG_OFST        (0xD4)              /**< (GPIO_SRCON1CLR)  Offset */
#define GPIO_SRCON1SET_REG_OFST        (0xD8)              /**< (GPIO_SRCON1SET)  Offset */
#define GPIO_SRCON1INV_REG_OFST        (0xDC)              /**< (GPIO_SRCON1INV)  Offset */

